export default (LocalConfig = {
     monthNames: [
          "มกราคม",
          "กุมพาพันธ์",
          "มีนาคม",
          "เมษายน",
          "พฤษภาคม",
          "มิถุนายน",
          "กรกฎาคม",
          "สิงหาคม",
          "กันยายน",
          "ตุลาคม",
          "พฤษจิกายน",
          "ธันวาคม"
     ],
     monthNamesShort: [
          "มก",
          "กุม",
          "มีนา",
          "เมษา",
          "พฤษ",
          "มิถุ",
          "กรกฎา.",
          "สิงหา",
          "กันยา.",
          "ตุลา.",
          "พฤษ.",
          "ธันวา"
     ],
     dayNames: [
          "จันทร์",
          "อังคาร",
          "พุธ",
          "พฤหัสบดี",
          "ศุกร์",
          "เสาร์",
          "อาทิตย์"
     ],
     dayNamesShort: ["จ.", "อ.", "พ.", "พฤ.", "ศ.", "ส.", "อา."],
     today: "วันนี้"
})
